Octopus/Documents/vrgРасходныйОрдерМобильный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgРасходныйОрдерМобильный</Name>
			<BasedOn>
				<xr:Item>Document.vrgПеремещениеМобильное</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgПеремещениеМобильное</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/Documents/vrgРасходныйОрдерМобильный/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.КоличествоЗаказ = 0;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)

	Модифицированность = Истина;
	ОбработатьВводШтрихкодаНаСервере();

	Если РучнойВводКоличества И ШтрихкодНайден Тогда
		ТекущийЭлемент = Элементы.Номенклатура;
		ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьВводШтрихкодаНаСервере()

	ВыборкаШтрихкода = Разработка.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	ШтрихкодНайден = (ВыборкаШтрихкода.Количество() <> 0);
	Если ВыборкаШтрихкода.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШтрихкода, , "Штрихкод");
		Если НЕ РучнойВводКоличества Тогда
			ДобавитьОбработатьСтрокуТоваров();
		КонецЕсли;
	Иначе
		Сообщить("По штрихкоду """ + СокрЛП(Штрихкод) + """ не знайдено жодного товару!");
	КонецЕсли;

	Штрихкод = "";

КонецПроцедуры

&НаСервере
Процедура ДобавитьОбработатьСтрокуТоваров()

	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры", Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаТовары = МассивСтрок[0];
	Иначе
		СтрокаТовары = Объект.Товары.Вставить(0);
	КонецЕсли;
	СтрокаТовары.Номенклатура = Номенклатура;
	СтрокаТовары.СерияНоменклатуры = СерияНоменклатуры;
	СтрокаТовары.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	СтрокаТовары.Количество = СтрокаТовары.Количество + ?(РучнойВводКоличества, РучноеКоличество * Коэффициент, Коэффициент);
	Количество = СтрокаТовары.Количество;
	КоличествоЗаказ = СтрокаТовары.КоличествоЗаказ;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		СкладПоУмолчанию = Константы.СкладПоУмолчанию.Получить();
		Если ЗначениеЗаполнено(СкладПоУмолчанию) И СкладПоУмолчанию <> Параметры.Основание.СкладОтправитель Тогда
			Сообщить("Склад відправник цього переміщення не збігається зі складом, до якого прив'язаний пристрій!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	УправлениеФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "1" И ВводДоступен() Тогда
		Штрихкод = СокрЛП(Параметр);
		ОбработатьВводШтрихкодаНаСервере(); //процедура для обработки ШК
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПеремещению(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ПеремещениеТоваров) Тогда
		Сообщить("Не вказано Переміщення товарів!");
		Возврат;
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Табличну частину товарів буде перезаповнено. Продовжити?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ЗаполнитьПоПеремещениюНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПеремещениюНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ПеремещениеТоваров);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоПеремещениюНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВводаКоличества" Тогда
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") ИЛИ НЕ ВыбранноеЗначение > 0 Тогда
			Возврат;
		КонецЕсли;
		РучноеКоличество = ВыбранноеЗначение;
		ДобавитьОбработатьСтрокуТоваров();
		//ТекущийЭлемент = Элементы.Штрихкод;
		//#Если МобильноеПриложениеКлиент Тогда
		//НачатьРедактированиеЭлемента();
		//#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	// для того, чтобы точно клавиатура пряталась или открывалась
	//Если ТекущаяСтраница = Элементы.СтраницаСканирование Тогда
	//	ТекущийЭлемент = Элементы.Штрихкод;
	//	НачатьРедактированиеЭлемента();
	//Иначе
	//	//ТекущийЭлемент = Элементы["ДекорацияДляФокусировки" + ТекущаяСтраница.Имя];
	//	//НачатьРедактированиеЭлемента()
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваровПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ПеремещениеТоваров) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Заповнити видатковий ордер за обраним переміщенням товарів?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	УправлениеФормамиКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);

КонецПроцедуры
